{
	"reviews": [
		{
			"date": "3/15/2020",
			"reviewer": "Jessica J",
			"text": "Ben was such a wonderful addition to our special day! We had a small wedding at Chautauqua Park, he was there before me (the bride!) and played for our guests before the wedding. He played mine and my husbands song while I walked down the isle, and then played a lesser known song we threw at him last minute after we were married. It was truly great!"
		},
		{
			"date": "12/23/2019",
			"reviewer": "Frank & Denise W ",
			"text": "Great music selections performed very, very well. Took requests from guests and played all. Ben has a friendly personality and is a professional as well."
		},
		{
			"date": "11/19/2019",
			"reviewer": "Irina M",
			"text": "I was extremely stressed looking for a band for our wedding, but we stumbled across Ben at a brewery one night. He is so talented!!!When we found out he did weddings we were totally stoked! He gave us so many options (like adding band members and instruments) in a convenient online form. We decided to add a drummer for a little something extra and it was perfect! When we looked at all of our wedding photos everyone was having so much fun singing and dancing. Ben really enjoys what he does and it really brings the fun into his crowd! Thank you Ben & Mike!"
		},
		{
			"date": "10/31/2019",
			"reviewer": "Mary C",
			"text": "We could not have asked for anything better than having Ben at our wedding! The number 1 question we got asked was, 'Where did you find this guy?' Ben exceeded our expectation in every single way. He was so much fun. He played to the crowd, had great energy and just blew us away. We asked him to go out of the way for a special introduction for the bridal party and he knocked it out of the park. He personalized a few songs as well as created a surprise mashup for our first dance. We genuinely could not have asked for better music at our wedding. Incredible!"
		},
		{
			"date": "9/13/2019",
			"reviewer": "Laura M",
			"text": "We had Ben play for our July wedding in Keystone. He played for our ceremony and cocktail hour. Ben is beyond wonderful in so many ways! He was so helpful in the communication beforehand – picking out songs, understanding the flow of the day, etc. He is an extremely talented musician and we were so excited to have our friends and family get to listen to him play! He knows the perfect songs to play for all the right moods, and does great mashups between songs too! He was able to go with the flow easily as well, as it began to rain right at the start of our outdoor cocktail hour. He moved inside quickly and continued the party! Everyone needs to hire him ASAP!! Thank you so much Ben!! 😊"
		},
		{
			"date": "9/12/2019",
			"reviewer": "Mary C",
			"text": "Ben Hammond really was the BEST EVER just like the rating says. Can't tell you how many guests were raving about the talent of Ben and the two guys he brought along to accompany him! Not only did he provide great music for the ceremony, his dance tunes really got everyone moving. I can't imagine you will find anyone better in the Denver area to make your wedding so special. Ben is a great talent and a nice guy as well. It was a pleasure and an honor to have him add his special touch to our daughter's wedding day!"
		},
		{
			"date": "9/11/2019",
			"reviewer": "Kate F",
			"text": "Ben was a great addition to our wedding! I loved his acoustic set for our ceremony and cocktail hour. Plus, we even kept him for campfire music in addition to our silent disco. It was perfect because there was something for everyone - the best of both worlds!!"
		},
		{
			"date": "7/03/2019",
			"reviewer": "Victoria C",
			"text": "Ben is a class act from start to finish. We went to see one of Ben’s local shows on a referral to see what we thought of him performing for our small back yard wedding. Ben has a wonderful voice and is a very talented musician with a gift for “mash ups”, looping and improvisation that keeps the audience engaged from beginning to end. He was happy to do all of our announcements and he not only learned some specific songs for us, he also added personal touches that made the music throughout the night all about us. People around our neighborhood have even come by and told us how much they enjoyed listening to him. As far as logistics, Ben’s contract, pricing and questionnaires are straight forward, easy to complete and Ben is just an email away ready to help whenever you need. And I don’t think I ever see him not smiling! We are so grateful we met Ben, he made our day more than amazing!"
		},
		{
			"date": "7/01/2019",
			"reviewer": "Lisa B",
			"text": "Ben was the highlight of our evening. Everyone had an amazing time and kept asking us where we found him! I am so glad we went with Ben instead of a DJ, he added so much life to our party. Can’t thank him enough, he is a wonderful artist!"
		},
		{
			"date": "7/01/2019",
			"reviewer": "Steve K",
			"text": "Ben and his drummer were the best!!! Three hours of music and he had everyone dancing the entire time- just what we wanted. All of our guests raved to us about how good the music was after. Ben was also super easy to work with and made the whole process a breeze. I would highly, highly recommend! Don’t even think about getting a dj."
		},
		{
			"date": "5/29/2019",
			"reviewer": "Elaine C",
			"text": "Ben Hammond and saxophone player, Tyler, were the hit of the party!! I'm looking to have another event just so they can perform -- truly professional and so much fun. We are still talking about their great performance!"
		},
		{
			"date": "1/22/2019",
			"reviewer": "Nikki H",
			"text": "Ben, where do we even begin! YOU and NIC ARE STILL BEING TALKED ABOUT!!! You made our wedding reception what it was and we couldn't have asked for anything more. You had the guests up and dancing the whole night!!! You were more than open to suggestions and song requests as well as SO thorough in making sure you had what you needed from us during the planning process. You continued to be responsive and made yourself available from start to finish. If we could do this all over again, we would still pick you! Thank you again for everything! To the bride and groom searching for an option other than a traditional DJ, Ben is your man! Prompt. Thorough. Timely. Professional. AND A WHOLE LOTTA FUN!!!"
		},
		{
			"date": "9/15/2018",
			"reviewer": "Alexander S",
			"text": "Ben and his trio were absolutely amazing! Ben was a pleasure to work with and provided us with a variety of options that helped us get exactly what we needed for our special event. He is truly a talented musician and was without a doubt the highlight of the night. From the ceremony, to the reception, Ben understood exactly how to set the mood and enhance the experience. Our event wouldn't have been the same without him. We simply couldn't recommend him more. Thank you Ben for making our special event that much more amazing!"
		},
		{
			"date": "9/07/2018",
			"reviewer": "Michelle O",
			"text": "Ben Hammond and his trio were a wonderful addition to our daughters wedding. He was beyond PROFESSIONAL, prompt in his response leading up to wedding, offered countless song selections to choose from, learned a couple new songs we requested too. His trio's volume was perfect for our reception. Loud enough to hear, but did not ever feel you had to shout over it. He was flexible in offering help when our schedule got delayed. He ALWAYS had a smile on his face. Ben is attentive to details, he arrived earlier than I expected and was prepared. Compared to some of the vendors we used, he did not have to be managed at any time. He followed his schedule, making adjustments as needed. Ben was a joy to work with. Thank you for your impeccable level of service and your exceptional musical talent. I love your gravelly voice too."
		},
		{
			"date": "9/01/2018",
			"reviewer": "Carolyn O",
			"text": "Ben Hammond is an outstanding musician with a very unique and personal style that added so much character to our special day. He was able to take classic songs and add a fun new twist to them while catering the style of the playing to the specific parts of our wedding. He was very organized and stayed exactly on schedule with all of the steps of our big day. He played with two other talented musicians and the atmosphere at the wedding was warm and inviting. Ben was extremely easy to work with and is a fun person to be around. He plays live all around Colorado and is definitely worth seeing if he stops by your neck of the woods! Ben is awesome!"
		},
		{
			"date": "7/27/2018",
			"reviewer": "Jaimie A",
			"text": "Ben was absolutely amazing to work with. We had him play for our ceremony and cocktail hour and the music was hands down amazing. He learned Dave Matthews You and Me along with Rachel Platten's A Better Place for the ceremony and we couldn't have loved it any more. Ben was so easy and nice to work with from the initial contact to the contract signing and day of set up. In the chaos of weddings it was so nice having that be an easy thing. I would recommend Ben to anyone that wants live music. Another fun thing was that he helped keep the kids entertained which was a huge help. Thank you Ben for everything!!!"
		},
		{
			"date": "10/25/2017",
			"reviewer": "Sydney H",
			"text": "We hired Ben to play at our client appreciation event. He was fun to work with before and during the event, was a great communicator, arrived ahead of schedule, and played the perfect music for the occasion! On top of his musical talents, Ben is friendly, personable, and brought great energy to our event. Thank you for making the night so special!"
		},
		{
			"date": "10/19/2017",
			"reviewer": "Carly M",
			"text": "Ben is awesome and so easy to work with! It was perfect background music during our ceremony and he aced our timing. He played upbeat music for cocktail hour and introduced us as Mr. & Mrs. before starting our playlist for the rest of the night."
		}
	]
}